docs/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>2023 Northeastern Systems Day - 2023 NEU SYSTEMS DAY</title>
    <meta charset="utf-8" />
    <meta name="author" content="" />
    <link rel="stylesheet" href="./media/css/main.css" type="text/css">
    <link rel="stylesheet" href="./media/css/prettify.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead" style="display: none;" >
        <h1 class="masthead-title"><a href="/">2023 NEU SYSTEMS DAY</a></h1>
        <p>THE SYSTEMS DAY </p>
        <!--
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/docs/">Docs</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/kelvinh/org-page">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="https://khoury-srg.github.io/Northeastern-Systems-Day-2023/">
        </form>
        -->
      </header>
    </div>

<div>
<div class="post">
<h1>2023 Northeastern Systems Day</h1>
<p>
The 2023 Northeastern Systems Day will take place on Tuesday, January 17th, 2023,
in room ISEC-655 (Northeastern University Interdisciplinary Science &amp; Engineering Complex,
805 Columbus Ave, Boston, MA 02120).
</p>

<p>
Northeastern Systems Day is a day-long student-led event to bring together members of the
Northeastern University community who conduct computer systems research.
</p>

<div id="outline-container-orge5eb1e0" class="outline-2">
<h2 id="orge5eb1e0">Call for participation</h2>
<div class="outline-text-2" id="text-orge5eb1e0">
<p>
We solicit talks about ongoing research in the area of computer systems.
We are broadly interested in topics in this space,
including, but not limited to, operating systems, file and storage systems,
distributed systems, cloud computing, mobile systems, reliable systems,
system security, machine learning systems, big data systems, embedded
systems, system virtualization, and management and troubleshooting of
complex systems.
</p>

<p>
To propose a talk, please send an email to Jian Zhang (zhang.jian3@northeastern.edu)
for registering your talk, and includes one or two paragraphs describing:
</p>
<ul class="org-ul">
<li>The title of your talk</li>
<li>The speaker's name and department</li>
<li>The length of your talk (we encourage the length to be 15min)</li>
<li>An abstract of your talk</li>
</ul>
</div>
</div>


<div id="outline-container-orgf0503f0" class="outline-2">
<h2 id="orgf0503f0">Schedule (subject to change)</h2>
<div class="outline-text-2" id="text-orgf0503f0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Speaker</th>
<th scope="col" class="org-left">Topic</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">08:00AM</td>
<td class="org-left">Breakfast available</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">9:00AM - 11:50AM</td>
<td class="org-left">Technical sessions + break with refreshments</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">11:50AM - 1:30PM</td>
<td class="org-left">Lunch</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1:30PM - 3:30AM</td>
<td class="org-left">Technical sessions + break with refreshments</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3:30PM</td>
<td class="org-left">Student networking</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org383b248" class="outline-2">
<h2 id="org383b248">Sponsors</h2>
<div class="outline-text-2" id="text-org383b248">
<p>
Thanks for <a href="https://www.khoury.northeastern.edu/">NEU Khoury College</a> for funding this event.
</p>
</div>
</div>

<div id="outline-container-org5e1a03a" class="outline-2">
<h2 id="org5e1a03a">Contact</h2>
<div class="outline-text-2" id="text-org5e1a03a">
<p>
Please send any questions to Cheng Tan &lt;c.tan@northeastern.edu&gt; and
Ji-Yong Shin &lt;j.shin@northeastern.edu&gt;.
</p>
</div>
</div>

</div>
</div>
    <div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
      <script src="./media/js/main.js"></script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:systemsday &lt;at&gt; chat2"></a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
